{"modelTopology": {"keras_version": "2.2.0", "backend": "tensorflow", "model_config": {"config": [{"config": {"filters": 32, "name": "conv2d_1", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "use_bias": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 64, "name": "conv2d_2", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "valid", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 128, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 10, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"optimizer_config": {"config": {"epsilon": 1e-07, "decay": 0.0, "rho": 0.95, "lr": 1.0}, "class_name": "Adadelta"}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "metrics": ["accuracy"], "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 1, 32]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [32]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [9216, 128]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [128]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [128, 10]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [10]}]}]}